Написать программу которая предоставляет пользователю возможность добавлять, удалять и просматривать список товаров. Для этого в программе должно быть реализовано меню с помощью консольного ввода/вывода.

Задание:

Создайте класс Product с одним полем - именем товара (типа String).
Создайте класс ProductList для хранения списка товаров и управления им. Класс должен содержать методы для добавления новых товаров в список, удаления товаров из списка и вывода списка на экран в формате номер товара - название товара.
Создайте класс Menu с методом start, который будет отображать меню и обрабатывать выбор пользователя.
В меню должны быть следующие опции:
Добавить товар
Удалить товар
Просмотреть список товаров
Выйти из программы
При выборе опции 1, пользователь должен ввести имя нового товара. Этот товар должен быть добавлен в список.
При выборе опции 2, пользователь должен ввести номер товара, который нужно удалить из списка.
При выборе опции 3, весь список товаров должен быть выведен на экран в формате номер товара - название товара.
При выборе опции 4, программа должна завершиться.
